CatoLynx/LCD-FIA/STM32/FIAControl/Src/fia.c
#include "fia.h"
#include "aditech.h"
#include "ds18b20.h"
#include "heap.h"
#include "sht21.h"
#include "spi.h"
#include "stm32f4xx_hal.h"
#include "uart_protocol.h"
#include "util.h"
#include <math.h>
#include <string.h>

int16_t backlightBaseBrightness[2] = {2048, 2048};
uint16_t lcdContrast[2] = {2048, 2048};
uint8_t firstADCReadFlag = 1;
uint8_t FIA_circulationFansOverrideBLBallast = 0;
uint8_t FIA_circulationFansOverrideHeatersTemp = 0;
uint8_t FIA_circulationFansOverrideHeatersHumidity = 0;

// Status variables for selected RAM per LCD bus
uint8_t FIA_LCDcurrentRAM[NUM_LCD_BUSES];

FIA_Side_t oldDoorStatus = SIDE_NONE;

void FIA_Init(void) {
    HAL_TIM_Base_Start(&DELAY_US_TIMER);
    HAL_TIM_Base_Start(&LCD_FRAME_TIMER);
    HAL_TIM_PWM_Start(&LCD_FRAME_TIMER, TIM_CHANNEL_1);
    HAL_TIM_Base_Start(&ADC_UPDATE_TIMER);
    HAL_TIM_Base_Start_IT(&ADC_UPDATE_TIMER);
    HAL_TIM_Base_Start(&DS18B20_UPDATE_TIMER);
    HAL_TIM_Base_Start_IT(&DS18B20_UPDATE_TIMER);
    HAL_DAC_Start(&LCD_CONTRAST_DAC, DAC1_CHANNEL_1);
    HAL_DAC_Start(&LCD_CONTRAST_DAC, DAC1_CHANNEL_2);
    HAL_ADC_Start_DMA(&ENV_BRIGHTNESS_ADC, adcValues, ADC_NUM_CHANNELS);

    heapInit();

    FIA_InitI2CDACs();

    FIA_SetStatusLED(1, 0);
    FIA_SetStatusLED(2, 0);

    UART_StartRxRingBuffer();

    FIA_SetBitmapDestinationBuffer(SIDE_BOTH);

    memset(FIA_staticBufferSideA, 0xFF, BITMAP_BUF_SIZE);
    memset(FIA_staticBufferSideB, 0xFF, BITMAP_BUF_SIZE);

    memset(FIA_maskBufferSideA, 0xFF, BITMAP_BUF_SIZE);
    memset(FIA_maskBufferSideB, 0xFF, BITMAP_BUF_SIZE);

    FIA_SetLCDContrast(SIDE_A, 2048);
    FIA_SetLCDContrast(SIDE_B, 2048);

    FIA_SetBacklightBrightness(SIDE_A, 0);
    FIA_SetBacklightBrightness(SIDE_B, 0);

    FIA_SetBacklight(1);
}

void FIA_InitI2CDACs(void) {
    uint8_t buf[3];
    buf[0] = 0b01000000; // Cmd: Write volatile mem, conf: ref=VDD, no power down, gain=1
    buf[1] = 0x00;
    buf[2] = 0x00;
    HAL_I2C_Master_Transmit(&PERIPHERALS_I2C, I2C_ADDR_DAC_BRIGHTNESS_A, buf, 3, I2C_TIMEOUT);
    HAL_I2C_Master_Transmit(&PERIPHERALS_I2C, I2C_ADDR_DAC_BRIGHTNESS_B, buf, 3, I2C_TIMEOUT);
}

void FIA_MainLoop(void) {
    UART_HandleProtocol();

    if (updateLCDContrastFlag) {
        FIA_UpdateLCDContrast();
        updateLCDContrastFlag = 0;
    }

    FIA_Side_t doorStatus = FIA_GetDoors();
    if (updateBacklightBrightnessFlag || (doorStatus != oldDoorStatus)) {
        // Auto-adjust brightness or set to minimum if door is open
        FIA_SetBacklightBrightness(
            SIDE_A, (doorStatus & SIDE_A) ? 0 : FIA_CalculateBacklightBrightness(SIDE_A, FIA_GetEnvBrightness(SIDE_A)));
        FIA_SetBacklightBrightness(
            SIDE_B, (doorStatus & SIDE_B) ? 0 : FIA_CalculateBacklightBrightness(SIDE_B, FIA_GetEnvBrightness(SIDE_B)));
        updateBacklightBrightnessFlag = 0;
        oldDoorStatus = doorStatus;
    }

    FIA_UpdateDisplayBuffers();
    FIA_UpdateDisplay(BUS_1);
    FIA_UpdateDisplay(BUS_2);
    FIA_UpdateDisplay(BUS_3);
    FIA_UpdateDisplay(BUS_4);
}

void FIA_ScrollBufferRelative(FIA_Scroll_Buffer_t* buf, int16_t xStep, int16_t yStep) {
    // Scroll a scroll buffer by the specified number of steps
    if (!buf->occupied)
        return;
    while (-xStep > buf->scrollOffsetX)
        xStep += buf->intW;
    while (-yStep > buf->scrollOffsetY)
        yStep += buf->intH;
    buf->scrollOffsetX += xStep;
    buf->scrollOffsetY += yStep;
    buf->scrollOffsetX %= buf->intW;
    buf->scrollOffsetY %= buf->intH;
}

void FIA_RenderScrollBuffer(FIA_Scroll_Buffer_t buf) {
    if (!buf.occupied || buf.side == SIDE_NONE)
        return;
    uint16_t intHBytes = buf.intH / 8;
    uint8_t baseBitOffset = buf.dispY % 8;
    int16_t scrollBitOffsetTmp = buf.scrollOffsetY - baseBitOffset;
    int16_t byteOffset = scrollBitOffsetTmp / 8;
    if (scrollBitOffsetTmp < 0)
        byteOffset -= 1;
    uint8_t scrollBitOffset = scrollBitOffsetTmp - (byteOffset * 8);
    uint8_t baseBitOffsetCmpl = 8 - baseBitOffset;
    uint8_t scrollBitOffsetCmpl = 8 - scrollBitOffset;
    uint8_t sbufWinAligned = (scrollBitOffset + baseBitOffset) % 8 == 0;
    uint8_t winDispAligned = baseBitOffset == 0;
    uint8_t sbufDispAligned = scrollBitOffset == 0;
    uint8_t renderA = buf.side == SIDE_A || buf.side == SIDE_BOTH;
    uint8_t renderB = buf.side == SIDE_B || buf.side == SIDE_BOTH;
    uint8_t* dispA = FIA_dynamicBufferSideA;
    uint8_t* dispB = FIA_dynamicBufferSideB;

    for (uint16_t x = 0; x < BITMAP_BUF_W_PX; x++) {
        // Continue if we're outside the display window
        if (x < buf.dispX || x > (buf.dispX + buf.dispW - 1))
            continue;

        uint16_t dispBaseIdx = x * BITMAP_BUF_H_BYTES;
        uint16_t sbufBaseIdx = ((x - buf.dispX + buf.scrollOffsetX) % buf.intW) * intHBytes;
        uint16_t renderByteIdx = 0;

        for (uint16_t yByte = 0; yByte < BITMAP_BUF_H_BYTES; yByte++) {
            uint16_t y1 = yByte * 8;
            uint16_t y2 = y1 + 7;

            // Y range check: Does the display window intersect the current byte?
            if (!((y1 <= buf.dispY + buf.dispH - 1) && (buf.dispY <= y2)))
                continue;

            uint16_t dispIdx = dispBaseIdx + yByte;
            uint16_t sbufOffset = renderByteIdx + byteOffset;
            uint16_t sbufIdx = sbufBaseIdx + (sbufOffset % intHBytes);
            uint16_t sbufNextIdx = sbufBaseIdx + ((sbufOffset + 1) % intHBytes);
            uint16_t numRenderBytes = ceil((double)(baseBitOffset + buf.dispH) / 8.0);
            uint16_t nextFullByteH = (renderByteIdx + 1) * 8;
            uint8_t isFirstByte = renderByteIdx == 0;
            uint8_t isLastByte = renderByteIdx >= numRenderBytes - 1;

            if (sbufWinAligned && winDispAligned) {
                // Everything is aligned, bytes can just be copied.
                // Last byte might have to be combined with display buffer
                // depending on window height.
                if (isLastByte) {
                    // Last byte - Combine existing display content
                    // with scroll buffer content
                    uint8_t keepBits = nextFullByteH - buf.dispH;
                    if (renderA)
                        dispA[dispIdx] =
                            (dispA[dispIdx] & (0xFF << (8 - keepBits))) | (buf.buf[sbufIdx] & (0xFF >> keepBits));
                    if (renderB)
                        dispB[dispIdx] =
                            (dispB[dispIdx] & (0xFF << (8 - keepBits))) | (buf.buf[sbufIdx] & (0xFF >> keepBits));
                } else {
                    // Any other byte - Copy straight from the scroll buffer
                    if (renderA)
                        dispA[dispIdx] = buf.buf[sbufIdx];
                    if (renderB)
                        dispB[dispIdx] = buf.buf[sbufIdx];
                }
            } else if (sbufWinAligned && !winDispAligned) {
                // Scroll buffer is aligned to window
                // but window is not aligned to display.
                // First byte will be combined with display buffer,
                // last byte might be combined depending on window height.
                // Scroll buffer bytes will be combined.
                if (isFirstByte && isLastByte) {
                    // First and last byte - display window is only one byte high or less
                    // Combine existing display content with scroll buffer content
                    uint8_t keepBits = nextFullByteH - baseBitOffset - buf.dispH;
                    uint8_t keepMask = (0xFF >> baseBitOffsetCmpl) | (0xFF << (8 - keepBits));
                    if (renderA)
                        dispA[dispIdx] =
                            (dispA[dispIdx] & keepMask) | ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] =
                            (dispB[dispIdx] & keepMask) | ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~keepMask);
                } else if (isFirstByte) {
                    // First byte - Combine disp & 1 sbuf
                    uint8_t keepMask = 0xFF >> baseBitOffsetCmpl;
                    if (renderA)
                        dispA[dispIdx] =
                            (dispA[dispIdx] & keepMask) | ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] =
                            (dispB[dispIdx] & keepMask) | ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~keepMask);
                } else if (isLastByte) {
                    // Last byte - Combine disp & 2 sbuf
                    uint8_t keepBits = nextFullByteH - baseBitOffset - buf.dispH;
                    uint8_t keepMask = 0xFF << (8 - keepBits);
                    uint8_t sbufMask = 0xFF >> scrollBitOffset;
                    if (renderA)
                        dispA[dispIdx] = (dispA[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] = (dispB[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                } else {
                    // Inbetween byte - Combine 2 sbuf
                    uint8_t sbufMask = 0xFF >> scrollBitOffset;
                    if (renderA)
                        dispA[dispIdx] = ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask);
                    if (renderB)
                        dispB[dispIdx] = ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask);
                }
            } else if (!sbufWinAligned && winDispAligned) {
                // Scroll buffer is not aligned to the window
                // but the window is aligned to the display.
                // Last byte will be combined with display buffer
                // depending on window height.
                // Scroll buffer bytes will be combined even in the first byte.
                if (isLastByte) {
                    // Last byte - Combine disp + 2 sbuf
                    uint8_t keepBits = nextFullByteH - buf.dispH;
                    uint8_t keepMask = 0xFF << (8 - keepBits);
                    uint8_t sbufMask = 0xFF >> scrollBitOffset;
                    if (renderA)
                        dispA[dispIdx] = (dispA[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] = (dispB[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                } else {
                    // Any other byte - Combine 2 sbuf
                    uint8_t sbufMask = 0xFF >> scrollBitOffset;
                    if (renderA)
                        dispA[dispIdx] = ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask);
                    if (renderB)
                        dispB[dispIdx] = ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask);
                }
            } else if (!sbufWinAligned && !winDispAligned && sbufDispAligned) {
                // Scroll buffer is not aligned to the window
                // and the window is not aligned to the display,
                // but the scroll buffer is aligned to the display.
                // First byte will be combined with display buffer,
                // Last byte will be combined with display buffer
                // depending on window height.
                // Scroll buffer bytes will not be combined.
                if (isFirstByte && isLastByte) {
                    // First and last byte - display window is only one byte high or less
                    // Combine disp + 1 sbuf
                    uint8_t keepBits = nextFullByteH - baseBitOffset - buf.dispH;
                    uint8_t keepMask = (0xFF >> baseBitOffsetCmpl) | (0xFF << (8 - keepBits));
                    if (renderA)
                        dispA[dispIdx] = (dispA[dispIdx] & keepMask) | (buf.buf[sbufIdx] & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] = (dispB[dispIdx] & keepMask) | (buf.buf[sbufIdx] & ~keepMask);
                } else if (isFirstByte) {
                    // First byte - Combine disp + 1 sbuf
                    uint8_t keepMask = 0xFF >> baseBitOffsetCmpl;
                    if (renderA)
                        dispA[dispIdx] = (dispA[dispIdx] & keepMask) | (buf.buf[sbufIdx] & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] = (dispB[dispIdx] & keepMask) | (buf.buf[sbufIdx] & ~keepMask);
                } else if (isLastByte) {
                    // Last byte - Combine disp + 1 sbuf
                    uint8_t keepBits = nextFullByteH - baseBitOffset - buf.dispH;
                    uint8_t keepMask = 0xFF << (8 - keepBits);
                    if (renderA)
                        dispA[dispIdx] = (dispA[dispIdx] & keepMask) | (buf.buf[sbufIdx] & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] = (dispB[dispIdx] & keepMask) | (buf.buf[sbufIdx] & ~keepMask);
                } else {
                    // Any other byte - Copy
                    if (renderA)
                        dispA[dispIdx] = buf.buf[sbufIdx];
                    if (renderB)
                        dispB[dispIdx] = buf.buf[sbufIdx];
                }
            } else if (!sbufWinAligned && !winDispAligned && !sbufDispAligned) {
                // Scroll buffer is not aligned to the window
                // and the window is not aligned to the display,
                // and the scroll buffer is not aligned to the display.
                // First byte will be combined with display buffer,
                // Last byte will be combined with display buffer
                // depending on window height.
                // Scroll buffer bytes will be combined.
                if (isFirstByte && isLastByte) {
                    // First and last byte - display window is only one byte high or less
                    // Combine disp + 2 sbuf
                    uint8_t keepBits = nextFullByteH - baseBitOffset - buf.dispH;
                    uint8_t keepMask = (0xFF >> baseBitOffsetCmpl) | (0xFF << (8 - keepBits));
                    uint8_t sbufMask = 0xFF >> scrollBitOffset;
                    if (renderA)
                        dispA[dispIdx] = (dispA[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] = (dispB[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                } else if (isFirstByte) {
                    // First byte - Combine disp + 2 sbuf
                    uint8_t keepMask = 0xFF >> baseBitOffsetCmpl;
                    uint8_t sbufMask = 0xFF >> scrollBitOffset;
                    if (renderA)
                        dispA[dispIdx] = (dispA[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] = (dispB[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                } else if (isLastByte) {
                    // Last byte - Combine disp + 2 sbuf
                    uint8_t keepBits = nextFullByteH - baseBitOffset - buf.dispH;
                    uint8_t keepMask = 0xFF << (8 - keepBits);
                    uint8_t sbufMask = 0xFF >> scrollBitOffset;
                    if (renderA)
                        dispA[dispIdx] = (dispA[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                    if (renderB)
                        dispB[dispIdx] = (dispB[dispIdx] & keepMask) |
                                         ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask & ~keepMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask & ~keepMask);
                } else {
                    // Any other byte - Combine 2 sbuf
                    uint8_t sbufMask = 0xFF >> scrollBitOffset;
                    if (renderA)
                        dispA[dispIdx] = ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask);
                    if (renderB)
                        dispB[dispIdx] = ((buf.buf[sbufIdx] >> scrollBitOffset) & sbufMask) |
                                         ((buf.buf[sbufNextIdx] << scrollBitOffsetCmpl) & ~sbufMask);
                }
            } else {
                // This should never happen.
                // Ignore if it does.
            }

            renderByteIdx++;
        }
    }
}

void FIA_RenderScrollBuffers(void) {
    if (FIA_scrollBufferCount == 0)
        return;
    for (uint8_t i = 0; i < MAX_SCROLL_BUFFERS; i++) {
        FIA_RenderScrollBuffer(FIA_scrollBuffers[i]);
    }
}

void FIA_UpdateDisplayBuffers(void) {
    // Render scroll buffers
    FIA_RenderScrollBuffers();

    // Blend static and dynamic buffers
    for (uint16_t i = 0; i < BITMAP_BUF_SIZE; i++) {
        FIA_displayBufferSideA[i] =
            (FIA_staticBufferSideA[i] & FIA_maskBufferSideA[i]) | (FIA_dynamicBufferSideA[i] & ~FIA_maskBufferSideA[i]);
        FIA_displayBufferSideB[i] =
            (FIA_staticBufferSideB[i] & FIA_maskBufferSideB[i]) | (FIA_dynamicBufferSideB[i] & ~FIA_maskBufferSideB[i]);
    }
}

void FIA_UpdateDisplay(FIA_LCD_Bus_t bus) {
    uint8_t panelRowOffset;
    uint8_t* bitmapBuffer;

    if (bus == BUS_1 || bus == BUS_3) {
        panelRowOffset = 0;
    } else {
        panelRowOffset = 1;
    }

    if (bus == BUS_1 || bus == BUS_2) {
        bitmapBuffer = FIA_displayBufferSideA;
    } else {
        bitmapBuffer = FIA_displayBufferSideB;
    }

    if (!LCD_IsTransmitActive(bus)) {
        LCD_ConvertBitmap(lcdDataBuffers[bus], bitmapBuffer, panelRowOffset, FIA_LCDcurrentRAM[bus]);
        LCD_TransmitBitmap(lcdDataBuffers[bus], NUM_HALF_PANELS, bus);
        if (FIA_LCDcurrentRAM[bus] == RAM1) {
            FIA_LCDcurrentRAM[bus] = RAM2;
        } else {
            FIA_LCDcurrentRAM[bus] = RAM1;
        }
    }
}

void FIA_StartBitmapReceive(void) {
    if (FIA_bitmapRxBuf == NULL || FIA_bitmapRxLen == 0) {
        return;
    }
    if (HAL_SPI_Receive_DMA(&BITMAP_DATA_SPI, FIA_bitmapRxBuf, FIA_bitmapRxLen) == HAL_OK) {
        FIA_SetStatusLED(2, 1);
        FIA_bitmapRxActive = 1;
    }
}

void FIA_AbortBitmapReceive(void) {
    if (!FIA_bitmapRxActive)
        return;
    if (HAL_SPI_Abort(&BITMAP_DATA_SPI) == HAL_OK) {
        FIA_SetStatusLED(2, 0);
        FIA_SetStatusLED(1, 0);
        FIA_bitmapRxActive = 0;
    }
}

