CatoLynx/LCD-FIA/STM32/FIAControl/Src/fia.c
uint8_t FIA_GetBacklightBallastFans(void) {
    return HAL_GPIO_ReadPin(FAN_4_GPIO_Port, FAN_4_Pin);
}

FIA_Side_t FIA_GetDoors(void) {
    // Get door open status: OPEN (1) or CLOSED (0)
    uint8_t doorA = !HAL_GPIO_ReadPin(DOOR_A_GPIO_Port, DOOR_A_Pin);
    uint8_t doorB = !HAL_GPIO_ReadPin(DOOR_B_GPIO_Port, DOOR_B_Pin);
    if (doorA && doorB)
        return SIDE_BOTH;
    if (doorA)
        return SIDE_A;
    if (doorB)
        return SIDE_B;
    return SIDE_NONE;
}

void FIA_StartExtTempSensorConv(void) {
    // Initiate a conversion in the external temperature sensors
    DS18B20_ConvertTemperature(TEMP_1_ONEWIRE_GPIO_Port, TEMP_1_ONEWIRE_Pin);
    DS18B20_ConvertTemperature(TEMP_2_ONEWIRE_GPIO_Port, TEMP_2_ONEWIRE_Pin);
}

void FIA_ReadTempSensors(void) {
    // Initiate a read from the temperature sensors
    double temp;
    temp = DS18B20_ReadTemperature(TEMP_1_ONEWIRE_GPIO_Port, TEMP_1_ONEWIRE_Pin);
    if (temp != DS18B20_ERROR)
        FIA_tempSensorValues[0] = temp;
    temp = DS18B20_ReadTemperature(TEMP_2_ONEWIRE_GPIO_Port, TEMP_2_ONEWIRE_Pin);
    if (temp != DS18B20_ERROR)
        FIA_tempSensorValues[1] = temp;
    FIA_tempSensorValues[2] = SHT21_GetTemperature();
    SHT21_HandleCommunication();
}

double FIA_GetTemperature(FIA_Temp_Sensor_t sensor) {
    // Get the value for the specified temperature sensor
    if (sensor < 0 || sensor > 3)
        return 0;
    return FIA_tempSensorValues[sensor];
}

double FIA_GetHumidity() {
    // Get the relative humidity of the inside air (in %)
    return SHT21_GetHumidity();
}

uint8_t FIA_CreateScrollBuffer(FIA_Side_t side, uint16_t dispX, uint16_t dispY, uint16_t dispW, uint16_t dispH,
                               uint16_t intW, uint16_t intH) {
    if (FIA_scrollBufferCount >= MAX_SCROLL_BUFFERS || FIA_nextFreeScrollBufferIndex == -1) {
        return SCROLL_BUFFER_ERR_COUNT;
    }

    size_t bufSize = intW * roundUp(intH, 8) / 8;
    uint8_t* buf = malloc(bufSize);
    if (buf == NULL) {
        return SCROLL_BUFFER_ERR_SIZE;
    }
    memset(buf, 0x00, bufSize);

    FIA_Scroll_Buffer_t* scrollBuffer = &FIA_scrollBuffers[FIA_nextFreeScrollBufferIndex];
    scrollBuffer->occupied = 1;
    scrollBuffer->side = side;
    scrollBuffer->dispX = dispX;
    scrollBuffer->dispY = dispY;
    scrollBuffer->dispW = dispW;
    scrollBuffer->dispH = dispH;
    scrollBuffer->intW = intW;
    scrollBuffer->intH = intH;
    scrollBuffer->bufSize = bufSize;
    scrollBuffer->buf = buf;
    uint8_t ret = FIA_nextFreeScrollBufferIndex | SCROLL_BUFFER_ID_MASK;
    FIA_UpdateNextFreeScrollBufferIndex();
    FIA_scrollBufferCount++;
    return ret;
}

uint8_t FIA_DeleteScrollBuffer(uint8_t id) {
    if (!(id & SCROLL_BUFFER_ID_MASK)) {
        return 0;
    }
    uint8_t bufIdx = id - SCROLL_BUFFER_ID_MASK;
    if (bufIdx >= MAX_SCROLL_BUFFERS) {
        return 0;
    }
    FIA_Scroll_Buffer_t* scrollBuffer = &FIA_scrollBuffers[bufIdx];
    if (!scrollBuffer->occupied || scrollBuffer->buf == NULL) {
        return 0;
    }
    if (FIA_bitmapRxBuf == scrollBuffer->buf) {
        // Prevent deletion of the currently active buffer
        return 0;
    }
    free(scrollBuffer->buf);
    scrollBuffer->occupied = 0;
    scrollBuffer->side = 0;
    scrollBuffer->dispX = 0;
    scrollBuffer->dispY = 0;
    scrollBuffer->dispW = 0;
    scrollBuffer->dispH = 0;
    scrollBuffer->intW = 0;
    scrollBuffer->intH = 0;
    scrollBuffer->bufSize = 0;
    scrollBuffer->buf = NULL;
    FIA_UpdateNextFreeScrollBufferIndex();
    FIA_scrollBufferCount--;
    return 1;
}

void FIA_UpdateNextFreeScrollBufferIndex(void) {
    for (uint8_t i = 0; i < MAX_SCROLL_BUFFERS; i++) {
        if (!FIA_scrollBuffers[i].occupied) {
            FIA_nextFreeScrollBufferIndex = i;
            return;
        }
    }
    FIA_nextFreeScrollBufferIndex = -1;
}

uint8_t FIA_SetBitmapDestinationBuffer(uint8_t id) {
    if (id == SIDE_A) {
        FIA_bitmapRxBuf = FIA_staticBufferSideA;
        FIA_bitmapRxBoth = 0;
        FIA_bitmapRxLen = BITMAP_BUF_SIZE;
    } else if (id == SIDE_B) {
        FIA_bitmapRxBuf = FIA_staticBufferSideB;
        FIA_bitmapRxBoth = 0;
        FIA_bitmapRxLen = BITMAP_BUF_SIZE;
    } else if (id == SIDE_BOTH) {
        FIA_bitmapRxBuf = FIA_staticBufferSideA;
        FIA_bitmapRxBoth = 1;
        FIA_bitmapRxLen = BITMAP_BUF_SIZE;
    } else if (id & MASK_BUFFER_ID_MASK) {
        id &= ~MASK_BUFFER_ID_MASK;
        if (id == SIDE_A) {
            FIA_bitmapRxBuf = FIA_maskBufferSideA;
            FIA_bitmapRxBoth = 0;
            FIA_bitmapRxLen = BITMAP_BUF_SIZE;
        } else if (id == SIDE_B) {
            FIA_bitmapRxBuf = FIA_maskBufferSideB;
            FIA_bitmapRxBoth = 0;
            FIA_bitmapRxLen = BITMAP_BUF_SIZE;
        } else if (id == SIDE_BOTH) {
            FIA_bitmapRxBuf = FIA_maskBufferSideA;
            FIA_bitmapRxBoth = 1;
            FIA_bitmapRxLen = BITMAP_BUF_SIZE;
        }
    } else if (id & SCROLL_BUFFER_ID_MASK) {
        uint8_t bufIdx = id & ~SCROLL_BUFFER_ID_MASK;
        if (bufIdx >= MAX_SCROLL_BUFFERS) {
            return 0;
        }
        FIA_Scroll_Buffer_t* scrollBuffer = &FIA_scrollBuffers[bufIdx];
        if (!scrollBuffer->occupied || scrollBuffer->buf == NULL) {
            return 0;
        }
        FIA_bitmapRxBuf = scrollBuffer->buf;
        FIA_bitmapRxBoth = 0;
        FIA_bitmapRxLen = scrollBuffer->bufSize;
    } else {
        return 0;
    }

    return 1;
}

void FIA_RegulateTempAndHumidity(void) {
    int8_t htrState = -1, blBallState = -1, circState = -1, exchState = -1;

    if (FIA_GetDoors() != SIDE_NONE) {
        // At least one door is open, disable all fans
        htrState = 0;
        blBallState = 0;
        circState = 0;
        exchState = 0;
    } else {
        if (FIA_tempSensorValues[AIRFLOW] <= HEATERS_FULL_TEMP) {
            htrState = 2;
            circState = 2;
            FIA_circulationFansOverrideHeatersTemp = 1;
        } else if (FIA_tempSensorValues[AIRFLOW] <= HEATERS_HALF_TEMP) {
            htrState = 1;
            circState = 2;
            FIA_circulationFansOverrideHeatersTemp = 1;
        } else if (FIA_tempSensorValues[AIRFLOW] >= HEATERS_OFF_TEMP) {
            htrState = 0;
            if (FIA_circulationFansOverrideHeatersTemp && !FIA_circulationFansOverrideBLBallast &&
                !FIA_circulationFansOverrideHeatersHumidity) {
                circState = 0;
            }
            FIA_circulationFansOverrideHeatersTemp = 0;
        }

        double humidity = FIA_GetHumidity();
        if (humidity >= HEATERS_FULL_HUMIDITY) {
            htrState = 2;
            circState = 2;
            FIA_circulationFansOverrideHeatersHumidity = 1;
        } else if (humidity >= HEATERS_HALF_HUMIDITY) {
            htrState = 1;
            circState = 2;
            FIA_circulationFansOverrideHeatersHumidity = 1;
        } else if (humidity <= HEATERS_OFF_HUMIDITY) {
            htrState = 0;
            if (FIA_circulationFansOverrideHeatersHumidity && !FIA_circulationFansOverrideBLBallast &&
                !FIA_circulationFansOverrideHeatersTemp) {
                circState = 0;
            }
            FIA_circulationFansOverrideHeatersHumidity = 0;
        }

        if (FIA_tempSensorValues[AIRFLOW] >= HEATERS_CUTOFF_TEMP) {
            htrState = 0;
            if (FIA_circulationFansOverrideHeatersTemp && !FIA_circulationFansOverrideBLBallast &&
                !FIA_circulationFansOverrideHeatersHumidity) {
                circState = 0;
            }
            FIA_circulationFansOverrideHeatersTemp = 0;
        }

        if (FIA_tempSensorValues[BL_BALL] >= BL_BALLAST_FANS_ON_TEMP) {
            blBallState = 1;
        } else if (FIA_tempSensorValues[BL_BALL] <= BL_BALLAST_FANS_OFF_TEMP) {
            blBallState = 0;
        }

        if (FIA_tempSensorValues[BL_BALL] >= CIRCULATION_FANS_BL_BALLAST_ON_TEMP) {
            circState = 2;
            FIA_circulationFansOverrideBLBallast = 1;
        } else if (FIA_tempSensorValues[BL_BALL] <= CIRCULATION_FANS_BL_BALLAST_OFF_TEMP) {
            if (FIA_circulationFansOverrideBLBallast && !FIA_circulationFansOverrideHeatersTemp &&
                !FIA_circulationFansOverrideHeatersHumidity) {
                circState = 0;
            }
            FIA_circulationFansOverrideBLBallast = 0;
        }

        if (!FIA_circulationFansOverrideBLBallast && !FIA_circulationFansOverrideHeatersTemp &&
            !FIA_circulationFansOverrideHeatersHumidity) {
            if (FIA_tempSensorValues[AIRFLOW] >= CIRCULATION_FANS_FULL_TEMP) {
                circState = 2;
            } else if (FIA_tempSensorValues[AIRFLOW] >= CIRCULATION_FANS_HALF_TEMP) {
                circState = 1;
            } else if (FIA_tempSensorValues[AIRFLOW] <= CIRCULATION_FANS_OFF_TEMP) {
                circState = 0;
            }
        }

        if (FIA_tempSensorValues[AIRFLOW] >= HEAT_EXCHANGER_FAN_ON_TEMP) {
            exchState = 1;
        } else if (FIA_tempSensorValues[AIRFLOW] <= HEAT_EXCHANGER_FAN_OFF_TEMP) {
            exchState = 0;
        }
    }

    if (htrState != -1)
        FIA_SetHeaters(htrState);
    if (blBallState != -1)
        FIA_SetBacklightBallastFans(blBallState);
    if (circState != -1)
        FIA_SetCirculationFans(circState);
    if (exchState != -1)
        FIA_SetHeatExchangerFan(exchState);
}

void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef* hspi) {
    if (hspi == &BITMAP_DATA_SPI) {
        FIA_bitmapRxActive = 0;
        FIA_SetStatusLED(2, 0);
        FIA_SetStatusLED(1, 1);
        if (FIA_bitmapRxBoth) {
            if (FIA_bitmapRxBuf == FIA_staticBufferSideA) {
                memcpy(FIA_staticBufferSideB, FIA_staticBufferSideA, BITMAP_BUF_SIZE);
            } else if (FIA_bitmapRxBuf == FIA_maskBufferSideA) {
                memcpy(FIA_maskBufferSideB, FIA_maskBufferSideA, BITMAP_BUF_SIZE);
            }
        }
    }
}